app/views/groups/index.html.erb

SELECT "group_purchases".* FROM "group_purchases" WHERE "group_purchases"."group_id" IN ($1, $2)  [["group_id", 2], ["group_id", 1]]
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                <% @total = 0 %>
                <% group.group_purchases.each { |e| @total += e.purchase.amount }%>