app/views/groups/older_index.html.erb

      <% @total = 0 %>
      <% group.group_purchases.each { |e| @total += e.purchase.amount }%>
---
SELECT "group_purchases".* FROM "group_purchases" WHERE "group_purchases"."group_id" IN ($1, $2)  [["group_id", 1], ["group_id", 2]]
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]