app/controllers/groups_controller.rb

  def index
    @groups = Group.where(user: current_user).includes(:group_purchases).order(created_at: :desc).limit(4)
---
SELECT "group_purchases".* FROM "group_purchases" WHERE "group_purchases"."group_id" IN ($1, $2)  [["group_id", 2], ["group_id", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1 ORDER BY "groups"."created_at" DESC LIMIT $2  [["user_id", 6], ["LIMIT", 4]]

  def older_index
    @groups = Group.where(user: current_user).includes(:group_purchases).order(created_at: :asc)
---
SELECT "group_purchases".* FROM "group_purchases" WHERE "group_purchases"."group_id" IN ($1, $2)  [["group_id", 1], ["group_id", 2]]
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1 ORDER BY "groups"."created_at" ASC  [["user_id", 6]]

  def show
    @group = Group.find(params[:id])
    @group_purchases = GroupPurchase.includes(:purchase).where(group_id: @group).order(created_at: :desc)
    @total = 0
    @group_purchases.each { |p| @total += p.purchase.amount }
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "group_purchases".* FROM "group_purchases" WHERE "group_purchases"."group_id" = $1 ORDER BY "group_purchases"."created_at" DESC  [["group_id", 2]]
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @group = Group.create(group_params)
    @group.user = current_user
    if @group.save
---
INSERT INTO "groups" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Armir plus Haadiiii"], ["icon", "https://www.iconfinder.com/search?q=rice"], ["user_id", 6], ["created_at", "2022-12-22 16:52:18.758549"], ["updated_at", "2022-12-22 16:52:18.758549"]]