app/controllers/groups_purchases_controller.rb

  def new
    @purchase = Purchase.new
    @groups = Group.where(user: current_user)
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 6]]

  def create
    @purchase = Purchase.new(purchase_params)
    @purchase.user_id = current_user.id
    if @purchase.save
      GroupPurchase.create(purchase_id: @purchase.id, group_id: params[:group])
---
INSERT INTO "purchases" ("name", "amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Mnnm"], ["amount", 23.0], ["user_id", 6], ["created_at", "2022-12-22 17:47:37.869656"], ["updated_at", "2022-12-22 17:47:37.869656"]]
INSERT INTO "group_purchases" ("group_id", "purchase_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 2], ["purchase_id", 1], ["created_at", "2022-12-22 17:47:37.901037"], ["updated_at", "2022-12-22 17:47:37.901037"]]